package main

import (
	"fmt"
	"unsafe"
)

func main ()  {
	//计算机是4GB，计算机内存地址是以字节为单位
	//字节又是以二进制为单位，实际上就是以0和1为单位
	x := 1
	y := 2
	z := 3
	fmt.Println(&x)
	fmt.Println(&y)
	fmt.Println(&z)
	fmt.Println(unsafe.Sizeof(x))

	//这就是计算机的内存地址
	//说明我电脑时64位，并且我的电脑上的int类型是8个字节
	//0xc000016090
	//0xc000016098
	//0xc0000160a0

	//0x0000000000
	//0x0000000001
	//0x0000000002
	//0x0000000003
	//0x0000000004
	//0x0000000005
	//............
	//0xc000016060 1
	//0xc000016061 //二进制 0000000
	//0xc000016062 //二进制 0000000
	//0xc000016063 //二进制 0000000
	//0xc000016064 //二进制 0000000
	//0xc000016065 //二进制 0000000
	//0xc000016066 //二进制 0000000
	//0xc000016067 //二进制 0000001
	//0xc000016068 2
	//0xc000016070 3
}
